{
  "backend/main.mo": "Main backend actor handling user profiles and a private per-user Q&A system with access control and CRUD operations.",
  "backend/migration.mo": "Migration module initializing new Q&A data structures from an older message-based actor state.",
  "feature_evidence.json": "Feature mapping file listing implemented frontend components, related features, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Global Tailwind/OKLCH theme defining warm color tokens, dark mode values, and base styling.",
  "frontend/index.html": "Base HTML document loading fonts and mounting the React application.",
  "frontend/src/App.tsx": "Root React component providing header, navigation tabs, and switching between Q&A and AI Video views.",
  "frontend/src/components/AuthStatus.tsx": "Header component showing branding, login/logout controls, and the caller’s profile name.",
  "frontend/src/components/MessageComposer.tsx": "Placeholder file for the chat message composer (no content provided).",
  "frontend/src/components/MessageFeed.tsx": "Placeholder file for the chat message feed (no content provided).",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog prompting new users to enter and save their profile name.",
  "frontend/src/components/QAComposer.tsx": "UI component for composing questions with text input, speech-to-text, validation, and submission via createQuestion hook.",
  "frontend/src/components/QAItemCard.tsx": "Displays a question with optional answer editing, saving, and text-to-speech playback using related hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAnswerQuestion.ts": "Mutation hook that submits an answer to a question and invalidates the questions query on success.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Hooks for fetching and saving the caller's user profile using the backend actor with cache invalidation.",
  "frontend/src/hooks/useChatMessages.ts": "Empty placeholder file for future chat message logic.",
  "frontend/src/hooks/useCreateQuestion.ts": "Mutation hook that sends a new question to the backend and refreshes the questions list.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handles identity loading, login, and logout via AuthClient.",
  "frontend/src/hooks/useQuestions.ts": "Fetches the latest questions from the backend actor and sorts them by creation time.",
  "frontend/src/hooks/useScrollAnchor.ts": "Empty placeholder file for future scroll anchor behavior.",
  "frontend/src/hooks/useSendMessage.ts": "Empty placeholder file for message-sending functionality.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements speech-to-text using the browser SpeechRecognition API with Nepali language support.",
  "frontend/src/hooks/useTextToSpeech.ts": "Provides text-to-speech playback with Nepali voice selection and speaking state management.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH-based theme variables for light and dark modes, plus base styling for body and borders.",
  "frontend/src/lib/chatValidation.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/download.ts": "Provides a helper to trigger browser file downloads using a temporary anchor element.",
  "frontend/src/lib/localClipGenerator.ts": "Generates a placeholder video-like blob by drawing styled text and gradients on a canvas and returning a downloadable mp4 blob URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders the main App component.",
  "frontend/src/pages/AIVideoPage.tsx": "Implements a UI for generating, validating, listing, and downloading placeholder AI video clips using local generation logic.",
  "frontend/src/pages/ChatPage.tsx": "Empty page component with no content.",
  "frontend/src/pages/MyQAPage.tsx": "Displays authenticated users' Nepali Q&A with profile checks, loading states, question listing, and a composer interface.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH theme colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Defines the project's current state, including features for private Nepali voice-enabled Q&A, Internet Identity authentication, and pending requirements for per-user privacy and Q&A storage. Lists existing features, new feature requests, architectural notes, and metadata."
}