{
  "kind": "build_request",
  "title": "Convert chat to private Nepali Q&A with speech-to-text and text-to-speech",
  "projectName": "Nepali Voice Q&A",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement per-user private storage and retrieval so that each authenticated user can only create and view their own Q&A items; no user should be able to read any other user's items, even if they know IDs or pagination parameters.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Developed a website for nepali people  to ask anything in nepali it should have voice features",
          "Only visible to the user",
          "Yes",
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "Backend persists Q&A items keyed by caller Principal and never returns items belonging to other Principals.",
        "All list/get operations scope results to the caller Principal.",
        "Unauthenticated/anonymous callers cannot create items; backend rejects attempts with a clear error message."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the global chat message model with a private Q&A model that supports: creating a question, listing the caller’s questions, and saving an optional answer for a question (answer authored/edited by the same caller).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ask anything in nepali",
          "private answer"
        ]
      },
      "acceptanceCriteria": [
        "There is a backend API to create a new question item (question text required).",
        "There is a backend API to list the caller’s Q&A items (newest-first or oldest-first must be consistent and documented in code).",
        "There is a backend API to set/update the answer text on an existing question owned by the caller.",
        "Backend validates text similarly to the current chat validation (trim whitespace-only, enforce max length, and rate-limit creation/updates).",
        "If the caller tries to update an item they do not own, the backend returns an authorization error."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend “Chat” experience to a private “My Q&A” page that only works when signed in with Internet Identity, showing the user’s own questions and answers and appropriate empty/loading/error states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Only visible to the user and user should access to internet",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "When the user is not authenticated, the page prompts sign-in and does not display any Q&A content.",
        "When authenticated, the page shows only the signed-in user’s Q&A items loaded from the backend.",
        "Empty state messaging is specific to private Q&A (e.g., no items yet).",
        "Existing app navigation remains functional (do not break the AI Video page)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add in-browser speech-to-text for Nepali input on the Q&A composer so users can dictate a question and have it populate the text input.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "it should have voice features"
        ]
      },
      "acceptanceCriteria": [
        "Composer includes a microphone control to start/stop speech recognition.",
        "When supported by the browser, dictated speech fills/updates the question input field.",
        "When speech recognition is not supported or permission is denied, the UI shows an English fallback message and the app remains usable via typing.",
        "Speech-to-text defaults to a Nepali locale when possible (e.g., ne-NP) while still accepting any resulting Unicode text."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add in-browser text-to-speech playback controls so users can listen to their question and/or answer read aloud.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "it should have voice features"
        ]
      },
      "acceptanceCriteria": [
        "Each rendered Q&A item provides a play button to read aloud the question text and, if present, the answer text.",
        "Playback uses the browser’s built-in speech synthesis; if unavailable, the UI shows an English message explaining that TTS is not supported.",
        "Playback can be stopped/cancelled from the UI (at least by toggling the same control).",
        "TTS attempts to select a Nepali voice if available, otherwise falls back to a default voice without breaking."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update user-facing labels and branding from generic “Chat” to a Nepali-focused private Q&A experience, while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Build it",
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "Navigation tab label and page headings reflect private Q&A (not “Chat”).",
        "Placeholders/hints encourage Nepali input (in English text, e.g., “Type in Nepali…”).",
        "No user-facing UI text is introduced in languages other than English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose these components instead).",
    "Do not edit frontend immutable hook files (frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if required for state upgrades."
  ],
  "nonGoals": [
    "Do not implement automated AI answering or LLM integrations.",
    "Do not fetch/browse external websites for answers.",
    "Do not add third-party authentication providers (Internet Identity only).",
    "Do not add real-time WebSocket-based updates (polling is acceptable)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Build a private Nepali Q&A web app with voice input (speech-to-text) and voice playback (text-to-speech) using Internet Identity for per-user data privacy."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Keep user-facing UI text in English while supporting Nepali content entry and playback."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}