{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Nepali Voice Q&A (private, Internet Identity, STT/TTS)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Replace Chat UI with an authenticated-only “My Q&A” page that loads and displays the signed-in user’s private questions and answers with proper loading/empty/error states.",
      "acceptanceCriteria": [
        "When the user is not authenticated, the page prompts sign-in and does not display any Q&A content.",
        "When authenticated, the page shows only the signed-in user’s Q&A items loaded from the backend.",
        "Empty state messaging is specific to private Q&A (e.g., no items yet).",
        "Existing app navigation remains functional (do not break the AI Video page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "rename",
          "description": "Rename the page to reflect the new private Q&A experience (e.g., MyQAPage) while preserving the existing AI Video navigation behavior."
        },
        {
          "path": "frontend/src/pages/MyQAPage.tsx",
          "operation": "create",
          "description": "Create the authenticated-only “My Q&A” page: gate all Q&A content behind Internet Identity, show loading/error/empty states, and render the user’s questions/answers using backend getQuestions plus compose components. Use the authorization component guidance to ensure no private data is shown before authentication. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the renamed/new “My Q&A” page into the existing navigation in place of Chat, keeping the AI Video page fully functional and reachable."
        },
        {
          "path": "frontend/src/components/AuthStatus.tsx",
          "operation": "modify",
          "description": "Update header behavior to align with the authorization component guidance: on logout, clear cached React Query data; avoid displaying the raw Principal id by default; optionally display a friendly name derived from the caller user profile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQuestions.ts",
          "operation": "create",
          "description": "Add a React Query hook that loads the authenticated caller’s Q&A list from the backend actor (getQuestions) and exposes loading/error states for the “My Q&A” page."
        },
        {
          "path": "frontend/src/hooks/useCreateQuestion.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook to create a question via the backend actor (createQuestion), then invalidate/refetch the questions query on success."
        },
        {
          "path": "frontend/src/hooks/useAnswerQuestion.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook to set/update an answer via the backend actor (answerQuestion), then invalidate/refetch the questions query on success."
        },
        {
          "path": "frontend/src/hooks/useCallerUserProfile.ts",
          "operation": "create",
          "description": "Use the authorization component’s user profile setup guidance by adding a query hook for getCallerUserProfile and a mutation hook for saveCallerUserProfile; expose derived UI state to prevent profile-setup modal flash. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupDialog.tsx",
          "operation": "create",
          "description": "Create a small profile setup dialog (name entry) shown only after login when no profile exists, using shadcn-ui dialog/input/button primitives. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add in-browser speech-to-text (Nepali locale preferred) to dictate questions into the Q&A composer with robust fallbacks.",
      "acceptanceCriteria": [
        "Composer includes a microphone control to start/stop speech recognition.",
        "When supported by the browser, dictated speech fills/updates the question input field.",
        "When speech recognition is not supported or permission is denied, the UI shows an English fallback message and the app remains usable via typing.",
        "Speech-to-text defaults to a Nepali locale when possible (e.g., ne-NP) while still accepting any resulting Unicode text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSpeechToText.ts",
          "operation": "create",
          "description": "Implement a reusable Web Speech API speech-recognition hook for speech-to-text: start/stop controls, ne-NP locale preference, interim/final transcript handling, and explicit unsupported/permission-denied error states."
        },
        {
          "path": "frontend/src/components/QAComposer.tsx",
          "operation": "create",
          "description": "Create the Q&A composer UI with a text input plus a microphone start/stop control wired to the speech-to-text hook; show an English fallback message when unsupported/blocked; keep typing fully usable. Use shadcn-ui input/button/card components for layout and states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MyQAPage.tsx",
          "operation": "modify",
          "description": "Wire the new QAComposer into the “My Q&A” page and connect it to question creation (useCreateQuestion), ensuring dictated text populates the same input used for submission."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add in-browser text-to-speech playback for each question and answer with stop/cancel and Nepali voice preference when available.",
      "acceptanceCriteria": [
        "Each rendered Q&A item provides a play button to read aloud the question text and, if present, the answer text.",
        "Playback uses the browser’s built-in speech synthesis; if unavailable, the UI shows an English message explaining that TTS is not supported.",
        "Playback can be stopped/cancelled from the UI (at least by toggling the same control).",
        "TTS attempts to select a Nepali voice if available, otherwise falls back to a default voice without breaking."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTextToSpeech.ts",
          "operation": "create",
          "description": "Implement a reusable Web Speech API speech-synthesis hook supporting play/stop toggling, voice selection preferring Nepali when available, and an explicit unsupported state."
        },
        {
          "path": "frontend/src/components/QAItemCard.tsx",
          "operation": "create",
          "description": "Create a Q&A item renderer that displays question/answer and includes per-field TTS play/stop controls using the text-to-speech hook; show English fallback messaging if TTS isn’t supported. Use shadcn-ui card/button components for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MyQAPage.tsx",
          "operation": "modify",
          "description": "Render the fetched questions list using QAItemCard so each item supports TTS for question and answer text."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Rebrand the UI from “Chat” to a Nepali-focused private Q&A experience while keeping all user-facing text in English.",
      "acceptanceCriteria": [
        "Navigation tab label and page headings reflect private Q&A (not “Chat”).",
        "Placeholders/hints encourage Nepali input (in English text, e.g., “Type in Nepali…”).",
        "No user-facing UI text is introduced in languages other than English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the navigation tab label from “Chat” to “My Q&A” and ensure the selected view naming reflects private Q&A while keeping AI Video unchanged."
        },
        {
          "path": "frontend/src/components/AuthStatus.tsx",
          "operation": "modify",
          "description": "Update header branding copy from generic “Chat” to a Nepali-focused private Q&A brand (English text only) while continuing to use existing generated assets already referenced by the header."
        },
        {
          "path": "frontend/src/pages/MyQAPage.tsx",
          "operation": "modify",
          "description": "Update page headings, empty-state copy, and sign-in prompts to reflect private Nepali Q&A (English text), including hints like “Type in Nepali…”."
        },
        {
          "path": "frontend/src/components/QAComposer.tsx",
          "operation": "modify",
          "description": "Ensure composer placeholder/help text encourages Nepali input (English text), and ensure any STT/TTS status/error messages remain English-only."
        }
      ]
    }
  ]
}